feat: add api resilience example (.NET10)
